Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ,System.Double,System.Boolean)
Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
ExporterIFC:
The exporter.
Plane:
The plane in which the face handles must lie.
ProjDir:
The normal vector to the input plane.
epsilon:
The epsilon value used to process surfaces.
createRepresentations:
Indicates if this should also create geometry representation handles.
Returns:
The new geometry info container.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateCurveGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.XYZ,System.Boolean)
Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
ExporterIFC:
The exporter.
lcs:
The local coordinate system that defines the plane in which the curve handles must lie.
projectionDir:
The normal vector to the input plane.
planViewOnly:
True to match curves with plan view visibility only, false to match curves regardless of their plan view visibility.
Returns:
The new geometry info container.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateCurveGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ,System.Boolean)
Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
ExporterIFC:
The exporter.
plane:
The plane in which the curve handles must lie.
projectionDir:
The normal vector to the input plane.
planViewOnly:
True to match curves with plan view visibility only, false to match curves regardless of their plan view visibility.
Returns:
The new geometry info container.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012